Revit 2026 API

# MultistoryStairsConnectLevels Method

---
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ConnectLevels(
	ISet<ElementId> levelIds
)
```
```vb
Public Sub ConnectLevels (
	levelIds As ISet(Of ElementId)
)
```
```cpp
public:
void ConnectLevels(
	ISet<ElementId^>^ levelIds
)
```
```fsharp
member ConnectLevels :
        levelIds : ISet<ElementId> -> unit
```

#### Parameters

levelIds ISetElementId

#### Reference

MultistoryStairs Class

Autodesk.Revit.DB.Architecture Namespace